DataFrame

In [2]:
from numpy.random import randn
import pandas as pd
import numpy as np

In [5]:
np.random.seed(101)
df = pd.DataFrame( randn(5,4), index = list("ABCDE"), columns = list("WXYZ"))

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [18]:
df["NewCol"] = df['W'] + df['Z']

In [15]:
df

          W         X         Y         Z    NewCol
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [16]:
del df['NewCol']

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df.drop("NewCol", axis= 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df

          W         X         Y         Z    NewCol
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [22]:
df.drop('B', axis = 0)

          W         X         Y         Z    NewCol
A  2.706850  0.628133  0.907969  0.503826  3.210676
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [28]:
df.loc['A'] # loc : explicit location using index name

W         2.706850
X         0.628133
Y         0.907969
Z         0.503826
NewCol    3.210676
Name: A, dtype: float64

In [29]:
df.iloc[3] # iloc: implicit location using 0-based index

W         0.188695
X        -0.758872
Y        -0.933237
Z         0.955057
NewCol    1.143752
Name: D, dtype: float64

In [31]:
df["X"]["C"]

np.float64(0.7401220570561068)

In [33]:
df.loc['C']['X']

np.float64(0.7401220570561068)

In [34]:
df.loc['C', 'X']

np.float64(0.7401220570561068)

In [35]:
df.iloc[2]['X']

np.float64(0.7401220570561068)

In [36]:
df >0

       W      X      Y      Z  NewCol
A   True   True   True   True    True
B   True  False  False   True    True
C  False   True   True  False   False
D   True  False  False   True    True
E   True   True   True   True    True

In [37]:
df[df>0]

          W         X         Y         Z    NewCol
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118       NaN       NaN  0.605965  1.257083
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [39]:
df['W'] >0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [40]:
df[df['W']>0]

          W         X         Y         Z    NewCol
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [43]:
df[(df['W']>0) & (df['Y'] >0)]

          W         X         Y         Z    NewCol
A  2.706850  0.628133  0.907969  0.503826  3.210676
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [46]:
df.reset_index()

  index         W         X         Y         Z    NewCol
0     A  2.706850  0.628133  0.907969  0.503826  3.210676
1     B  0.651118 -0.319318 -0.848077  0.605965  1.257083
2     C -2.018168  0.740122  0.528813 -0.589001 -2.607169
3     D  0.188695 -0.758872 -0.933237  0.955057  1.143752
4     E  0.190794  1.978757  2.605967  0.683509  0.874303

In [47]:
df['S'] = list("MNOPQ")

In [48]:
df

          W         X         Y         Z    NewCol  S
A  2.706850  0.628133  0.907969  0.503826  3.210676  M
B  0.651118 -0.319318 -0.848077  0.605965  1.257083  N
C -2.018168  0.740122  0.528813 -0.589001 -2.607169  O
D  0.188695 -0.758872 -0.933237  0.955057  1.143752  P
E  0.190794  1.978757  2.605967  0.683509  0.874303  Q

In [49]:
df.set_index('S')

          W         X         Y         Z    NewCol
S
M  2.706850  0.628133  0.907969  0.503826  3.210676
N  0.651118 -0.319318 -0.848077  0.605965  1.257083
O -2.018168  0.740122  0.528813 -0.589001 -2.607169
P  0.188695 -0.758872 -0.933237  0.955057  1.143752
Q  0.190794  1.978757  2.605967  0.683509  0.874303

In [50]:
df[df.columns[1:3]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [51]:
df.columns

Index(['W', 'X', 'Y', 'Z', 'NewCol', 'S'], dtype='object')

# Pandas 

### Multi-index
### Handle Missing Data
### Groupby

In [52]:
outside = ['G1','G1','G1', 'G2', 'G2', 'G3']

In [53]:
inside = [1,2,3,1,2,3]

In [57]:
hier_index = list(zip(outside,inside))

In [58]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [59]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G3', 3)],
           )

In [60]:
df = pd.DataFrame(np.random.randn(6,2), index= hier_index, columns=['A', 'B'] )

In [61]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
G3 3  0.638787  0.329646

In [63]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [64]:
df.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960

In [66]:
df.loc['G2'].loc[1]

A    0.166905
B    0.184502
Name: 1, dtype: float64

In [67]:
df.loc['G2'].iloc[0]

A    0.166905
B    0.184502
Name: 1, dtype: float64

In [68]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
G3 3  0.638787  0.329646

In [69]:
df.iloc[5]

A    0.638787
B    0.329646
Name: (G3, 3), dtype: float64

In [70]:
df.index.names = ['Group','Num']

In [71]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
G3    3    0.638787  0.329646

cross-selection .xs

In [72]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [75]:
df.xs(1,level = 'Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

In [76]:
np.nan

nan

In [77]:
2 * np.nan

nan

In [78]:
df = pd.DataFrame({'A': [1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]})

In [79]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [80]:
df.dropna

<bound method DataFrame.dropna of      A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3>

In [82]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [84]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [86]:
df.dropna(thresh=2, axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [87]:
df.fillna(value='Myvalue')

         A        B  C
0      1.0      5.0  1
1      2.0  Myvalue  2
2  Myvalue  Myvalue  3

In [88]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [90]:
df['A'].mean()

np.float64(1.5)

In [91]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [92]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [93]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [94]:
df.fillna(value = df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [95]:
df.fillna(value= df.min())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.0  5.0  3

In [96]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Group By

In [97]:
data = {
        'Company': ['GOOD','GOOD','MSFT', 'MSFT', 'FB', 'FB'],
        'Person' : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sale' : [200,120,340,124,243,350]
        }

In [98]:
data

{'Company': ['GOOD', 'GOOD', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sale': [200, 120, 340, 124, 243, 350]}

In [100]:
df = pd.DataFrame(data)

In [101]:
df

  Company   Person  Sale
0    GOOD      Sam   200
1    GOOD  Charlie   120
2    MSFT      Amy   340
3    MSFT  Vanessa   124
4      FB     Carl   243
5      FB    Sarah   350

In [102]:
by_comp = df.groupby('Company')

In [103]:
by_comp

In [105]:
by_comp.max()

          Person  Sale
Company
FB         Sarah   350
GOOD         Sam   200
MSFT     Vanessa   340

In [106]:
by_comp.count()

         Person  Sale
Company
FB            2     2
GOOD          2     2
MSFT          2     2

In [108]:
by_comp.describe()

         Sale
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOD      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [114]:
by_comp.describe().T

Company             FB        GOOD        MSFT
Sale count    2.000000    2.000000    2.000000
     mean   296.500000  160.000000  232.000000
     std     75.660426   56.568542  152.735065
     min    243.000000  120.000000  124.000000
     25%    269.750000  140.000000  178.000000
     50%    296.500000  160.000000  232.000000
     75%    323.250000  180.000000  286.000000
     max    350.000000  200.000000  340.000000

combining dataframes: merging, join, concatenating

In [ ]:
df1 = pd.DataFrame(
    
    {'A' : ['A0', 'A1', 'A2', 'A3'],
     'B' : ['B0', 'B1', 'B2', 'B3'],
     'C' : ['C0', 'C1', 'C2', 'C3'],
     'D' : ['D0', 'D1', 'D2', 'D3']
     },
    index = [0,1,2,3]
    
    )

df2 = pd.DataFrame(
    
    {'A' : ['A4', 'A5', 'A6', 'A7'],
     'B' : ['B4', 'B5', 'B6', 'B7'],
     'C' : ['C4', 'C5', 'C6', 'C7'],
     'D' : ['D4', 'D5', 'D6', 'D7']
     },
    index = [4,5,6,7]
    
    )

df3 = pd.DataFrame(
    
    {'A' : ['A8', 'A9', 'A10', 'A11'],
     'B' : ['B8', 'B9', 'B10', 'B11'],
     'C' : ['C8', 'C9', 'C10', 'C11'],
     'D' : ['D8', 'D9', 'D10', 'D11']
     },
    index = [8,9,10,11]
    
    )

In [116]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [118]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [119]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [120]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [123]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [124]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
pd.concat([df1,df2], axis = 1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [128]:
pd.concat([df1,df2], axis = 1)['B']

     B    B
0   B0  NaN
1   B1  NaN
2   B2  NaN
3   B3  NaN
4  NaN   B4
5  NaN   B5
6  NaN   B6
7  NaN   B7

Merging

In [129]:

left = pd.DataFrame(
    
    {'key' : ['K0', 'K1', 'K2', 'K3'],
     'B' : ['A0', 'A1', 'A2', 'A3'],
     'C' : ['B0', 'B1', 'B2', 'B3']
     }
    
    )


right = pd.DataFrame(
    
    {'key' : ['K0', 'K1', 'K2', 'K3'],
     'B' : ['C0', 'C1', 'C2', 'C3'],
     'C' : ['D0', 'D1', 'D2', 'D3']
     }
    
    )

In [130]:
left

  key   B   C
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [131]:
right

  key   B   C
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [132]:
pd.concat([left,right],axis =1)

  key   B   C key   B   C
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [135]:
pd.merge(left,right, how = 'inner', on = 'key')

  key B_x C_x B_y C_y
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [139]:
left.join(right, how = 'outer', on = 'key')

ValueError: You are trying to merge on object and int64 columns for key 'key'. If you wish to proceed you should use pd.concat